{
  "title": "Avocado Prosciutto Brie Sandwiches",
  "description": "Avocado Prosciutto Brie Sandwiches with blood orange mango chutney are just the thing to bring out when spring is in full swing. The sweet and spicy chutney gives this sandwich a star power that will be the center of everyone’s attention. It’s the amazing combination bright, light, salty and peppery flavors that every flaky croissant is begging to be piled up with.",
  "imgUrl": "https://food-fanatic-res.cloudinary.com/iu/s--vK0Gv-AK--/t_xlarge_l/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1522165396/avocado-prosciutto-brie-sandwiches-photo.jpg",
  "yield": "2 servings",
  "prepTime": 10,
  "cookTimeLabel": "Cook Time",
  "cookTime": 15,
  "additionalTimeLabel": "Additional Time",
  "additionalTime": 10,
  "ingredients": "For the Blood Orange Mango Chutney:\n\n2 large Blood Oranges\n1 tablespoon Vegetable Oil\n1/2 cup Yellow Onion, chopped\n1 tablespoon Minced Fresh Jalapeño\n1 1/2 teaspoons Curry Powder\n1/4 teaspoon Salt\n1/4 teaspoon Cayenne Pepper\n2 cups Mango, chopped\n1/2 cup Apple Cider Vinegar\n1/2 cup Dark Brown Sugar, packed\n\n\nFor the Sandwiches:\n\n2 Croissants, split in half\n6 slices Prosciutto\n1 Avocado, peeled, pitted and sliced\n6 ounces Brie Cheese, sliced\n1 cup Arugula",
  "instructions": "1. To make the chutney, zest blood orange to yield 1 tablespoon. Remove the peel and pith from the oranges. Segment the oranges over an empty bowl. Discard the remaining insides of the fruits.\n\n2. Heat a saucepan over medium-high heat. Add vegetable oil. Once the oil is hot, add the onion, jalapeño, curry powder, salt, and cayenne. Cook for 2 minutes, stirring constantly.\n\n3. Add in the mango and cook for another 2 minutes, still stirring. Add in the orange segments with their juice, vinegar, sugar and zest. Cook for another 2 minutes while stirring.\n\n4. Reduce heat and simmer, stirring every so often, until thickened, approximately 25 to 30 minutes. Remove from heat. Let cool before serving.\n\n5. To make the sandwiches, top the bottom halves of the croissant sandwiches with 3 slices of prosciutto and half of the brie slices.\n\n6. Add the bottom halves to a small baking sheet. Place in the oven under the broiler set to high. Broil until cheese is gooey and melted.\n\n7. Remove from oven and add bottom halves of the sandwiches to plates. Top with 2 to 3 slices of avocado, followed by a layer of arugula and then mango chutney. Top with top halves of the croissant and serve.",
  "notes": "Only one serving if you're particularly hungry ;)"
}